/****************************************************************/
/**
 *	@file	s_user_hook_tbl.h
 *	@brief	フックテーブル公開定義
 *	$Date:: 2017-02-14 01:17:45 +0900#$
 *	$Rev: 4 $
 *	$Author: ROKI $
*/
/****************************************************************/
#ifndef S_USER_HOOK_TBL_H
#define S_USER_HOOK_TBL_H

/*==============================================================*/
/*	インクルード												*/
/*==============================================================*/
/*==============================================================*/
/*	外部型定義													*/
/*==============================================================*/

typedef struct xn_msg_hook_t {									/* メッセージHook型						*/
	const UINT			m_wndMsg;								/**< ウィンドウメッセージ				*/
	const lrCallHook	m_hook;									/**< 対応するHook関数					*/
} xn_msg_hook;

typedef struct xn_hook_info_tbl_t {								/* Hook情報テーブル型					*/
	const WNDPROC		m_wndproc;								/**< 呼び出し元WindowProcedure			*/
	const size_t		m_len;									/**< メッセージ数						*/
	const xn_msg_hook *	m_tbl;									/**< メッセージHook						*/
	const lrCallHook	m_hook;									/**< 検索失敗時のHook関数				*/
} xn_hook_info_tbl;

/*==============================================================*/
/*	外部定数定義												*/
/*==============================================================*/
/*==============================================================*/
/*	外部関数プロトタイプ										*/
/*==============================================================*/
extern const xn_hook_info_tbl * g_hooktblGet( const WNDPROC a_wndproc );
																/* Hook情報テーブル取得					*/

#endif /* S_USER_HOOK_TBL_H */
/* End of file *************************************************/
